learning1234embed/Intermittent-Learning/intermittent_k_nn_acc/driverlib/MSP430FR5xx_6xx/saph.h
typedef struct _asq_ping_config
{
    //! Sets ASQ ping counter for polarity.
    uint16_t polarity;
    //! Sets ASQ ping counter for pause level.
    uint16_t pauseLevel;
    //! Sets ASQ ping counter for high impedance.
    uint16_t pauseHighImpedance;
} SAPH_configASQPingParam;

//*****************************************************************************
//
// The following are values that can be passed to the mask parameter for
// functions: SAPH_clearInterrupt(), SAPH_enableInterrupt(), and 
// SAPH_disableInterrupt() as well as returned by the 
// SAPH_getInterruptStatus() function.
//
//*****************************************************************************
#define SAPH_DATA_ERROR_INTERRUPT                                       DATAERR
#define SAPH_TIMEMARK_F_TIMEOUT_INTERRUPT                                 TMFTO
#define SAPH_ACQUISITION_SEQUENCER_DONE_INTERRUPT                         SEQDN
#define SAPH_PING_TRANSMIT_DONE_INTERRUPT                                 PNGDN

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePHY().
//
//*****************************************************************************
#define SAPH_PHY_CHANNEL_1                                                    0
#define SAPH_PHY_CHANNEL_2                                                    1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePHY().
//
//*****************************************************************************
#define SAPH_PHY_OUTPUT_HIGH                                           CH0OUT_1
#define SAPH_PHY_OUTPUT_LOW                                            CH0OUT_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePHY().
//
//*****************************************************************************
#define SAPH_PHY_OUTPUT_ENABLE                                          CH0OE_1
#define SAPH_PHY_OUTPUT_DISABLE                                         CH0OE_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePHY().
//
//*****************************************************************************
#define SAPH_PHY_FULLPULL_ENABLE                                        CH0FP_1
#define SAPH_PHY_FULLPULL_DISABLE                                       CH0FP_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePHY().
//
//*****************************************************************************
#define SAPH_PHY_TERMINATION_ENABLE                                   CH0TERM_1
#define SAPH_PHY_TERMINATION_DISABLE                                  CH0TERM_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePHY().
//
//*****************************************************************************
#define SAPH_PHY_OUTPUT_GENERAL_PURPOSE                               PCH0SEL_0
#define SAPH_PHY_OUTPUT_PULSEGENERATOR_SINGLE_DRIVE                   PCH0SEL_1
#define SAPH_PHY_OUTPUT_PULSEGENERATOR_DIFFERENTIAL_DRIVE             PCH0SEL_2

//*****************************************************************************
//
// The following are values that can be passed to the enableDummyLoad parameter
// for functions: SAPH_configurePHYMultiplexer().
//
//*****************************************************************************
#define SAPH_PHY_DUMMYLOAD_ENABLE                                       DUMEN_1
#define SAPH_PHY_DUMMYLOAD_DISABLE                                      DUMEN_0

//*****************************************************************************
//
// The following are values that can be passed to the sourceControl parameter
// for functions: SAPH_configurePHYMultiplexer().
//
//*****************************************************************************
#define SAPH_PHY_SOURCE_CONTROLLED_BY_REGISTER                         MUXCTL_0
#define SAPH_PHY_SOURCE_CONTROLLED_BY_ASQ                              MUXCTL_1

//*****************************************************************************
//
// The following are values that can be passed to the inputChannel parameter
// for functions: SAPH_configurePHYMultiplexer().
//
//*****************************************************************************
#define SAPH_PHY_INPUT_CHANNEL_0                                  MUXSEL__CH0IN
#define SAPH_PHY_INPUT_CHANNEL_1                                  MUXSEL__CH1IN

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePHYBias().
//
//*****************************************************************************
#define SAPH_PHY_BIAS_SWITCH_OPEN                                     CH0EBSW_0
#define SAPH_PHY_BIAS_SWITCH_CLOSED                                   CH0EBSW_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePHYBias().
//
//*****************************************************************************
#define SAPH_PHY_PGA_BIAS_GROUNDED                                    PGABIAS_0
#define SAPH_PHY_PGA_BIAS_LOW_VALUE                                   PGABIAS_1
#define SAPH_PHY_PGA_BIAS_NOMINAL_VALUE                               PGABIAS_2
#define SAPH_PHY_PGA_BIAS_HIGH_VALUE                                  PGABIAS_3

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePHYBias().
//
//*****************************************************************************
#define SAPH_PHY_EXCITATION_BIAS_GROUNDED                             EXCBIAS_0
#define SAPH_PHY_EXCITATION_BIAS_LOW_VALUE                            EXCBIAS_1
#define SAPH_PHY_EXCITATION_BIAS_NOMINAL_VALUE                        EXCBIAS_2
#define SAPH_PHY_EXCITATION_BIAS_HIGH_VALUE                           EXCBIAS_3

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePHYBias().
//
//*****************************************************************************
#define SAPH_PHY_MULTIPLEXER_CHARGEPUMP_ENABLE                           CPDA_1
#define SAPH_PHY_MULTIPLEXER_CHARGEPUMP_DISABLE                          CPDA_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePHYBias().
//
//*****************************************************************************
#define SAPH_PHY_LEAKAGE_COMPENSATION_ENABLE                             LILC_1
#define SAPH_PHY_LEAKAGE_COMPENSATION_DISABLE                            LILC_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePHYBias().
//
//*****************************************************************************
#define SAPH_PHY_PGA_BIAS_SWITCH_OPEN                                  PGABSW_0
#define SAPH_PHY_PGA_BIAS_SWITCH_CLOSED                                PGABSW_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePHYBias().
//
//*****************************************************************************
#define SAPH_PHY_BIAS_SWITCH_CONTROLLED_BY_REGISTER                    ASQBSC_0
#define SAPH_PHY_BIAS_SWITCH_CONTROLLED_BY_ASQ                         ASQBSC_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePPGCount().
//
//*****************************************************************************
#define SAPH_PPG_HIGH_IMPEDANCE_ON_PAUSE_HIGH                            PHIZ_1
#define SAPH_PPG_HIGH_IMPEDANCE_ON_PAUSE_LOW                             PHIZ_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePPGCount().
//
//*****************************************************************************
#define SAPH_PPG_PAUSE_LEVEL_HIGH                                        PLEV_1
#define SAPH_PPG_PAUSE_LEVEL_LOW                                         PLEV_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePPGCount().
//
//*****************************************************************************
#define SAPH_PPG_PAUSE_POLARITY_HIGH                                     PPOL_0
#define SAPH_PPG_PAUSE_POLARITY_LOW                                      PPOL_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePPG().
//
//*****************************************************************************
#define SAPH_PPG_PRESCALER_ENABLE                                       PSCEN_1
#define SAPH_PPG_PRESCALER_DISABLE                                      PSCEN_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePPG().
//
//*****************************************************************************
#define SAPH_PPG_TRIGGER_SOURCE_SOFTWARE                                TRSEL_0
#define SAPH_PPG_TRIGGER_SOURCE_ASQ                                     TRSEL_1
#define SAPH_PPG_TRIGGER_SOURCE_TIMER                                   TRSEL_2

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePPG().
//
//*****************************************************************************
#define SAPH_PPG_CHANNEL_0                                           PPGCHSEL_0
#define SAPH_PPG_CHANNEL_1                                           PPGCHSEL_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configurePPG().
//
//*****************************************************************************
#define SAPH_PPG_PORT_CHARGED_BY_PPG                                    PGSEL_0
#define SAPH_PPG_PORT_CHARGED_BY_ASEQ                                   PGSEL_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configureASQ().
//
//*****************************************************************************
#define SAPH_ASQ_ABORT_ON_ERROR_ENABLE                                 ERABRT_1
#define SAPH_ASQ_ABORT_ON_ERROR_DISABLE                                ERABRT_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configureASQ().
//
//*****************************************************************************
#define SAPH_ASQ_TRIGGER_SOURCE_SOFTWARE                        TRIGSEL__SWTRIG
#define SAPH_ASQ_TRIGGER_SOURCE_P_SEQUENCER                        TRIGSEL__PSQ
#define SAPH_ASQ_TRIGGER_SOURCE_TIMER                            TRIGSEL__TIMER

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configureASQ().
//
//*****************************************************************************
#define SAPH_ASQ_CHANNEL_0                                           ASQCHSEL_0
#define SAPH_ASQ_CHANNEL_1                                           ASQCHSEL_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configureASQ().
//
//*****************************************************************************
#define SAPH_ASQ_DIFFERENT_CHANNEL                                      CHOWN_0
#define SAPH_ASQ_IDENTICAL_CHANNEL                                      CHOWN_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configureASQ().
//
//*****************************************************************************
#define SAPH_ASQ_STANDBY_INDICATION_POWEROFF                      STDBY__PWROFF
#define SAPH_ASQ_STANDBY_INDICATION_STANDBY                        STDBY__STDBY

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configureASQ().
//
//*****************************************************************************
#define SAPH_ASQ_END_OF_SEQUENCE_OFF_DISABLE                            ESOFF_0
#define SAPH_ASQ_END_OF_SEQUENCE_OFF_ENABLE                             ESOFF_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configureASQ().
//
//*****************************************************************************
#define SAPH_ASQ_EARLY_RECEIVE_BIAS_BY_TIMEMARK_C                     EARLYRB_0
#define SAPH_ASQ_EARLY_RECEIVE_BIAS_BY_TIMEMARK_A                     EARLYRB_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_configureASQ().
//
//*****************************************************************************
#define SAPH_ASQ_TOGGLE_CHANNEL_ENABLE                                  CHTOG_1
#define SAPH_ASQ_TOGGLE_CHANNEL_DISABLE                                 CHTOG_0

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************

//*****************************************************************************
//
//! \brief Unlocks certain SAPH registers.
//!
//! Unlock SAPH registers with offset address of 0xF or higher. IIDX, MIS, RIS,
//! IMSC, ICR, ISR, DESCLO, and DESCHI registers are not affected and the
//! registers are not locked. Utilize this function if those registers need to
//! be modified.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//
//*****************************************************************************
extern void SAPH_unlock(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Locks certain SAPH registers.
//!
//! Locks SAPH registers with offset address of 0xF or higher. IIDX, MIS, RIS,
//! IMSC, ICR, ISR, DESCLO, and DESCHI registers are not affected and the
//! registers are not locked. Utilize this function after SAPH_unlock()
//! after necessary registers have been modified.
//! SAPH registers, with the exception of the list in paragraph above, are
//! locked by default.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//
//*****************************************************************************
extern void SAPH_lock(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Clears SAPH interrupts.
//!
//! The SAPH interrupt source is cleared, so that it no longer asserts. If the
//! interrupt is not enabled, the corresponding bit in the RIS register bit will
//! be cleared. If the interrupt is enabled, the corresponding bit both MIS and 
//! RIS registers will be both cleared.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param mask is the logical OR of any of the following:
//!        - \b SAPH_DATA_ERROR_INTERRUPT - SAPH data error interrupt
//!        - \b SAPH_TIMEMARK_F_TIMEOUT_INTERRUPT - SAPH TMF time out interrupt
//!        - \b SAPH_ACQUISITION_SEQUENCER_DONE_INTERRUPT - SAPH acquistion sequencer done interrupt
//!        - \b SAPH_PING_TRANSMIT_DONE_INTERRUPT - SAPH ping transmit done interrupt
//!
//! \return None
//
//*****************************************************************************
extern void SAPH_clearInterrupt(uint16_t baseAddress, uint8_t mask);

//*****************************************************************************
//
//! \brief Enables SAPH interrupts.
//!
//! Enables the indicated SAPH interrupt sources.  Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor. <b>Does not clear interrupt flags.</b>
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param mask is the logical OR of any of the following:
//!        - \b SAPH_DATA_ERROR_INTERRUPT - SAPH data error interrupt
//!        - \b SAPH_TIMEMARK_F_TIMEOUT_INTERRUPT - SAPH TMF time out interrupt
//!        - \b SAPH_ACQUISITION_SEQUENCER_DONE_INTERRUPT - SAPH acquistion sequencer done interrupt
//!        - \b SAPH_PING_TRANSMIT_DONE_INTERRUPT - SAPH ping transmit done interrupt
//!
//! \return None
//
//*****************************************************************************
extern void SAPH_enableInterrupt(uint16_t baseAddress, uint8_t mask);

//*****************************************************************************
//
//! \brief Disables selected SAPH interrupt sources.
//!
//! Disables the indicated SAPH interrupt sources.  Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param mask is the logical OR of any of the following:
//!        - \b SAPH_DATA_ERROR_INTERRUPT - SAPH data error interrupt
//!        - \b SAPH_TIMEMARK_F_TIMEOUT_INTERRUPT - SAPH TMF time out interrupt
//!        - \b SAPH_ACQUISITION_SEQUENCER_DONE_INTERRUPT - SAPH acquistion sequencer done interrupt
//!        - \b SAPH_PING_TRANSMIT_DONE_INTERRUPT - SAPH ping transmit done interrupt
//!
//! \return None
//
//*****************************************************************************
extern void SAPH_disableInterrupt(uint16_t baseAddress, uint8_t mask);

//*****************************************************************************
//
//! \brief Gets the current SAPH interrupt status.
//!
//! This returns the interrupt status for the SAPH module based on which flag
//! is passed.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param mask is the logical OR of any of the following:
//!        - \b SAPH_DATA_ERROR_INTERRUPT - SAPH data error interrupt
//!        - \b SAPH_TIMEMARK_F_TIMEOUT_INTERRUPT - SAPH TMF time out interrupt
//!        - \b SAPH_ACQUISITION_SEQUENCER_DONE_INTERRUPT - SAPH acquistion sequencer done interrupt
//!        - \b SAPH_PING_TRANSMIT_DONE_INTERRUPT - SAPH ping transmit done interrupt
//!
//! \return Logical OR of any of the following:
//!        - \b SAPH_DATA_ERROR_INTERRUPT - SAPH data error interrupt
//!        - \b SAPH_TIMEMARK_F_TIMEOUT_INTERRUPT - SAPH TMF time out interrupt
//!        - \b SAPH_ACQUISITION_SEQUENCER_DONE_INTERRUPT - SAPH acquistion sequencer done interrupt
//!        - \b SAPH_PING_TRANSMIT_DONE_INTERRUPT - SAPH ping transmit done interrupt
//
//*****************************************************************************
extern uint8_t SAPH_getInterruptStatus(uint16_t baseAddress, uint8_t mask);

//*****************************************************************************
//
//! \brief Configures physical interface output and trim values.
//!
//! This configures SAPH physical interface including channel output and channel
//! related trim values.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param config is the pointer to the struct for physical interface configuration.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configurePHY(uint16_t baseAddress, SAPH_configPHYParam *config);

//*****************************************************************************
//
//! \brief Configures physical interface multiplexer.
//!
//! This configures SAPH physical interface mutliplexer for dummy load, channel
//! multiplexer source control and input channel selection.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param enableDummyLoad indicates whether to enable/disable dummy load on non-
//!        selected multiplexer inputs.
//!        Valid values are:
//!        - \b SAPH_PHY_DUMMYLOAD_ENABLE
//!        - \b SAPH_PHY_DUMMYLOAD_DISABLE [Default]
//! \param sourceControl selects which controls the multiplexer.
//!        Valid values are:
//!        - \b SAPH_PHY_SOURCE_CONTROLLED_BY_REGISTER [Default]
//!        - \b SAPH_PHY_SOURCE_CONTROLLED_BY_ASQ
//! \param inputChannel selects input channel.
//!        Valid values are:
//!        - \b SAPH_PHY_INPUT_CHANNEL_0 [Default]
//!        - \b SAPH_PHY_INPUT_CHANNEL_1
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configurePHYMultiplexer(uint16_t baseAddress,
        uint16_t enableDummyLoad, uint16_t sourceControl, uint16_t inputChannel);

//*****************************************************************************
//
//! \brief Configures physical interface bias.
//!
//! This configures SAPH physical interface bias parameters including excitation
//! bias switch, PGA bias, excitation bias, charge pump, line input leakage
//! compensation and ASQ bias.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param config is the pointer to the struct for physical interface bias configuration.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configurePHYBias(uint16_t baseAddress,
        SAPH_configPHYBiasParam *config);

