learning1234embed/Intermittent-Learning/intermittent_k_nn_acc/driverlib/MSP430FR5xx_6xx/saph.h
//*****************************************************************************
//
//! \brief Configures pulse generator count.
//!
//! This configures SAPH pulse generator count on high impedance, pause level,
//! pause polarity, stop pulse and excitation pulse.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param config is the pointer to the struct for pulse generator count configuration.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configurePPGCount(uint16_t baseAddress,
        SAPH_configPPGCountParam *config);

//*****************************************************************************
//
//! \brief Sets pulse generator low period.
//!
//! The low phase of period of generator pulses defines the length of low phase
//! of the pulses in units of high speed clocks. The minimum count is two regardless
//! of the value set in this register.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param period is the low period value to set.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_setPPGLowPeriod(uint16_t baseAddress, uint16_t period);

//*****************************************************************************
//
//! \brief Sets pulse generator high period.
//!
//! The high phase of period of generator pulses defines the length of high phase
//! of the pulses in units of high speed clocks. The minimum count is two regardless
//! of the value set in this register.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param period is the high period value to set.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_setPPGHighPeriod(uint16_t baseAddress, uint16_t period);

//*****************************************************************************
//
//! \brief Configures pulse generator.
//!
//! This configures SAPH pulse generator including trigger source, prescaler
//! enable, channel select and control select.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param config is the pointer to the struct for pulse generator configuration.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configurePPG(uint16_t baseAddress, SAPH_configPPGParam *config);

//*****************************************************************************
//
//! \brief Triggers pulse generator.
//!
//! This function triggers the pulse generator if SAPH_PPG_TRIGGER_SOURCE_SOFTWARE
//! is selectes as the trigger sourcce.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_triggerPPG(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Stops pulse generator.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_stopPPG(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Configures acquisiton sequencer.
//!
//! This configures SAPH acquisiton sequencer including trigger source, abort-on-
//! error control, channel select, side of channel to receive, standby indication,
//! OFF at end-of-sequence, early receive bias and channel toggle.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param config is the pointer to the struct for acquisiton sequencer configuration.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configureASQ(uint16_t baseAddress, SAPH_configASQParam *config);

//*****************************************************************************
//
//! \brief Triggers acquisiton sequencer.
//!
//! This function triggers the acquisiton sequencer if SAPH_ASQ_TRIGGER_SOURCE_SOFTWARE
//! is selectes as the trigger sourcce.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_triggerASQ(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Stops acquisiton sequencer.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_stopASQ(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Gets ping counter of acquisiton sequencer.
//!
//! This function returns ping counter which represents the number of acquistion
//! turns regardless if up/down direction is changed. The acquistion stops if
//! this count decrements from zero.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern uint8_t SAPH_getASQPingCounter(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Configures acquisiton sequencer ping parameters.
//!
//! This configures SAPH acquisiton sequencer ping output polarity, ping pause
//! level, ping pause impedance.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param config is the pointer to the struct for acquisiton sequencer ping 
//!        configuration.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configureASQPing(uint16_t baseAddress,
        SAPH_configASQPingParam *config);

//*****************************************************************************
//
//! \brief Configures acquisiton sequencer time base parameters.
//!
//! This configures SAPH acquisiton sequencer time base parameters including
//! power state and prescaler start value.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param prescalerStartValue is the ASQ prescaler start value.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configureASQTimeBase(uint16_t baseAddress,
        uint16_t prescalerStartValue);

//*****************************************************************************
//
//! \brief Starts acquisiton timer.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_startASQTimer(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Stops acquisiton timer.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_stopASQTimer(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Clears acquisiton timer.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_clearASQTimer(uint16_t baseAddress);

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif
#endif // __MSP430WARE_SAPH_H__

